[
  {
    "id": 1,
    "email": "rs@robertsnajder.com",
    "artist_alias": "SNAJDER",
    "country": "Denmark",
    "age": "42",
    "act": "Producer/DJ",
    "other": "",
    "genre": "Electronic Dance Music",
    "unique_selling_points": "Technical Skills, My Music, Customized Sets,",
    "long_bio": "Meet SNAJDER, a seasoned DJ and music producer hailing from Denmark. With a musical journey spanning over two decades, SNAJDER, also known as Robert Snajder, embarked on his electronic music adventure at a young age, driven by a passion for success.<br>Having spent more than half of his career producing music under his birth name, Robert Snajder, SNAJDER has cultivated a powerful legacy in the realm of house music. However, he has recently reinvented himself, relaunching his career under the name SNAJDER with a fresh and innovative sound.<br>SNAJDER's musical roots trace back to his early days, where he started by playing at local venues in his hometown of Aarhus. Known for his ability to captivate and energize any crowd, SNAJDER delivers not just a performance but a memorable experience at every event.<br>Driven by an unwavering love for music, SNAJDER is a humble yet tenacious music producer with dreams of conquering the industry. Inspired by evolving trends in the music landscape, he began producing his own music in 2009, achieving success with his first club hit, \"Keep it clean,\" released in late 2010 with support from KÔLCH. His track \"Superman\" garnered over 1 million streams and earned him a deal with Warner Music.<br>Continuing to evolve, SNAJDER has reintroduced himself to the music scene, unveiling a new track in November 2023 under his revamped brand, SNAJDER. The second single, titled \"BREATH,\" features the talented Josie Sandfeld, showcasing SNAJDER's commitment to pushing boundaries and exploring new musical horizons.<br>SNAJDER's signature musical style encompasses Big Room, Mainstage, and Future Rave, allowing him to seamlessly navigate and enthrall audiences at various events, from clubs to festivals, both within and beyond the borders of Denmark. With an unyielding work ethic, SNAJDER is on a relentless pursuit to reach the pinnacle of his dreams, promising to leave an indelible mark on the global music scene.",
    "short_bio": "SNAJDER, a seasoned Danish DJ and music producer, embarked on his electronic music journey at a young age, amassing over 20 years of experience. With a powerful heritage in house music, he reintroduced his career under the name SNAJDER, embracing a new sound.<br>Driven by an unwavering love for music, SNAJDER began his career in Aarhus, playing local venues and captivating crowds with his dynamic performances. His dream is to reach the top, and he tirelessly works towards that goal, delivering exceptional shows wherever he plays.<br>Inspired by music trends, SNAJDER elevated his craft in 2009, producing his own music. In late 2010, he released the massive club hit \"Keep it clean,\" supported by KÔLCH (aka Rune Rk). Last year, SNAJDER's track \"Superman\" secured a deal with Warner Music, accumulating over 1 million streams.<br>Now, under his revitalized brand, SNAJDER unveils a new track in November 2023, titled \"BREATH,\" featuring Josie Sandfeld. His musical style spans Big Room, Mainstage, and Future Rave, captivating audiences at diverse events, including clubs and festivals both in and outside Denmark",
    "additional_talents": "0",
    "talents_details": "",
    "logo": "https://api.typeform.com/responses/files/0ef132226cd3597e2003b9d67522c6c87c42d55fa141e8ebb6a703557270f1f4/Snajder_Black_White_Logo.png",
    "headshot": "https://api.typeform.com/responses/files/8ae0d9ea743a2486e7ebfd8f24f258044b667c0e641163d462628a944e0cca60/SNAJDER_Shoot.jpg",
    "artist_rider": "https://api.typeform.com/responses/files/efbce5e85526732dad701c756972610efce4ecc41c6ab6fd690579b897f3f8d9/RIDER_SNAJDER.pdf",
    "facebook_link": "https://www.facebook.com/snajderofficial/",
    "instagram_link": "http://instagram.com/snajderofficial/",
    "twitter_link": "https://twitter.com/Robertsnajder",
    "youtube_link": "https://www.youtube.com/@snajderofficial",
    "spotify_link": "https://open.spotify.com/artist/5neUaZK8atePE27M4gWZtz?si=QvP7-OghSraV4GsnxQ1nIg",
    "bandcamp_link": "",
    "beatport_link": "https://www.beatport.com/artist/snajder/1154525",
    "soundcloud_link": "http://soundcloud.com/snajderofficial",
    "twitch_link": "http://twitch.tv/snajder_official",
    "sound_better_link": "",
    "website_link": "http://snajderofficial.com",
    "other_link": "https://docs.google.com/spreadsheets/d/1uT0dA9qs8K8wP2RauFj5ieMtPTZmOWrgifvncrO1jzU/edit#gid=0",
    "management_timeline": "https://docs.google.com/spreadsheets/d/1N0-t7YpgE_ihcjd8sNd3EMO9KjW-rA0G2XEiehjDHmk/edit#gid=1839572700",
    "start_date": "2023-11-19 20:04:55",
    "submit_date": "2023-11-19 20:34:57",
    "network_id": "6253720235",
    "tags": ""
  },
  {
    "id": 2,
    "email": "relentless201267@googlemail.com",
    "artist_alias": "Dan Thompson",
    "country": "UK",
    "age": "40",
    "act": "Producer/DJ",
    "other": "",
    "genre": "Trance",
    "unique_selling_points": "I feel that always stay true to the classic style of producing Trance music but also keeping it current",
    "long_bio": "DJ & producer Dan Thompson is with out doubt one of the most exciting British names to emerge onto the international DJ circuit!<br><br>In the years since he broke into the global music scene, Dan has accomplished incredible success with a barrage of original, remixed and collaborative music on some of the worlds most prestigious and influential trance labels including; A State Of Trance, Future Sound Of Egypt, Magik Muzik, Flashover Recordings & Coldharbour Recordings, and is highly regarded as ‘one to watch’ for 2020 by some of the leading names in the industry.<br><br>Dan's first original release of 2020 is a collaborative vocal project with the Grammy nominated singer and songwriter JES, and is the first of many releases on the horizon!<br><br>With his international fanbase soaring, streaming statistics and chart presence at an all time high, the future is very bright for this undeniable talent!",
    "short_bio": "DJ & producer Dan Thompson is with out doubt one of the most exciting British names to emerge onto the international DJ circuit!<br><br>In the years since he broke into the global music scene, Dan has accomplished incredible success with a barrage of original, remixed and collaborative music on some of the worlds most prestigious and influential trance labels including; A State Of Trance, Future Sound Of Egypt, Magik Muzik, Flashover Recordings & Coldharbour Recordings, and is highly regarded as ‘one to watch’ for 2020 by some of the leading names in the industry.<br><br>Dan's first original release of 2020 is a collaborative vocal project with the Grammy nominated singer and songwriter JES, and is the first of many releases on the horizon!<br><br>With his international fanbase soaring, streaming statistics and chart presence at an all time high, the future is very bright for this undeniable talent!",
    "additional_talents": "0",
    "talents_details": "",
    "logo": "https://api.typeform.com/responses/files/ba647b70bb0d14d6d66d5aa6553240d63654a735ec2292130905fbb8b2843ae7/Dan_Thompson_Logo_Stacked_Complete_Dark_.eps",
    "headshot": "https://api.typeform.com/responses/files/baeb11f05a748b7b0ca9b41eedc2395b365fcaff212a20f471d0031d30dd6fb0/IMG_20161224_WA0003.jpg",
    "artist_rider": "",
    "facebook_link": "https://www.facebook.com/DanThompsonOfficial",
    "instagram_link": "https://instagram.com/danthompsonofficial?igshid=YTQwZjQ0NmI0OA==",
    "twitter_link": "https://x.com/DanThompsonDJ?t=fIrQ8lEm6AXntONkBU7gZA&s=09",
    "youtube_link": "https://youtube.com/@relentless201267?si=gmtBVu7Pti_VKUbp",
    "spotify_link": "",
    "bandcamp_link": "",
    "beatport_link": "https://www.beatport.com/artist/dan-thompson/274076",
    "soundcloud_link": "https://on.soundcloud.com/CnKax",
    "twitch_link": "",
    "sound_better_link": "",
    "website_link": "",
    "other_link": "https://docs.google.com/spreadsheets/d/1Mv6ONvKg8fyZeOxlUtBxeC7AwhIUiG23Q54xdhGa_o8/edit#gid=0",
    "management_timeline": "https://docs.google.com/spreadsheets/d/12MUrZAMTMrkxphrL3bXuj3Pcw6SXrM4kzcH2z3fQWBc/edit#gid=1839572700",
    "start_date": "2023-11-19 13:44:09",
    "submit_date": "2023-11-19 14:30:45",
    "network_id": "39a3e6585b",
    "tags": ""
  },
  {
    "id": 3,
    "email": "office@djvansnyder.com",
    "artist_alias": "Van Snyder",
    "country": "Austria",
    "age": "33",
    "act": "Producer/DJ",
    "other": "",
    "genre": "Electronic Dance Music",
    "unique_selling_points": "I am a good music producer (specialized in: electronic dance music), can perform as DJ too and am able to make a unique branding of the project \"Van Snyder\".",
    "long_bio": "Van Snyder, real name Imre Kis, is an International DJ and Producer.<br><br>Born December 11th 1989, Van Snyder has greatly contributed to the music industry through his talent, consistency and hard work.<br><br>Young and vibrant Van Snyder is a sponge soaked with talent and he has continuously released mind-blowing hits after hits, including official music videos and other singles which have been remixed by renowned artists like Headhunterz, Klaas, Michael Mind Project, Plastik Funk, Sean Finn and PH Electro.<br><br>This creative genius has also made remixes for AAA listers as: Akon, Bonnie Tyler, Flo Rida, Lil Wayne & T-Pain and tyDi. These productions were released by top labels such as Sony Music Entertainment, Kontor Records and Black Hole Recordings.<br><br>Van Snyder is currently signed with:<br><br>Warner Music Denmark,<br>Revealed Recordings,<br>Black Hole Recordings,<br>Reaching Altitude,<br>Tiger Records and<br>Zero Cool Records.<br><br>Van Snyder is supported by the top elite DJs on the globe including: Tiësto, Robin Schulz, Hardwell, AFROJACK, Nicky Romero, Dimitri Vegas & Like Mike, R3HAB, Blasterjaxx and many, many more!<br><br>International MGMT: Evolved Music Group",
    "short_bio": "Van Snyder, real name Imre Kis, is an International DJ and Producer.<br><br>Van Snyder was born Dec, 11th 1989 in Tulln, Austria.<br><br>During his career Van Snyder has released singles inlcuding official music videos and other singles which have been remixed by renowned artists like Headhunterz, Klaas, Plastik Funk and more.<br><br>This creative genius has also made remixes for AAA listers as: Akon, Bonnie Tyler, Flo Rida, Lil Wayne & T-Pain and tyDi.<br><br>Van Snyder is currently signed with many top labels and supported by top elite DJs including: Tiësto and Robin Schulz.<br><br>International MGMT: Evovled Music Group",
    "additional_talents": "1",
    "talents_details": "Logo Designing, (i use GIMP and Photoshop) but it's just a hobby for now.",
    "logo": "https://api.typeform.com/responses/files/2c6796c2669fabc61326b982e38ef8f9227da60f5f5bda79953171ad34d86f41/Portrait_2023_v100.png",
    "headshot": "https://api.typeform.com/responses/files/52c892a49be220f5482ec52a46c3e38519d9011a371a4e78f142221596af1913/Portrait_2023_v100.png",
    "artist_rider": "",
    "facebook_link": "https://www.facebook.com/vansnydermusic",
    "instagram_link": "https://www.instagram.com/vansnydermusic",
    "twitter_link": "https://www.twitter.com/notwitternorXavailable",
    "youtube_link": "https://www.youtube.com/@vansnydermusic",
    "spotify_link": "https://open.spotify.com/artist/3hxJ7exqIsY8CkbNh26b4P",
    "bandcamp_link": "https://www.bandcamp.com/dontknowaboutthis",
    "beatport_link": "https://www.beatport.com/de/artist/van-snyder/108464",
    "soundcloud_link": "https://www.soundcloud.com/vansnyderofficial",
    "twitch_link": "https://www.twitch.tv/notavailable",
    "sound_better_link": "https://www.soundbetter.com/notavailableoridontknow",
    "website_link": "https://www.vansnyder.us",
    "other_link": "https://nl.wikipedia.org/wiki/Van_Snyder",
    "management_timeline": "https://docs.google.com/spreadsheets/d/1eecxC1Uim-gwmhgGuIw-cJfOYLnrASzwWUv2oazmAy4/edit#gid=1839572700",
    "start_date": "2023-11-14 22:53:18",
    "submit_date": "2023-11-14 23:08:22",
    "network_id": "ac7225246c",
    "tags": ""
  },
  {
    "id": 4,
    "email": "larsnyheim@gmail.com",
    "artist_alias": "The Blizzard",
    "country": "Norway",
    "age": "39",
    "act": "Producer/DJ",
    "other": "",
    "genre": "Trance",
    "unique_selling_points": "Music that speaks to the soul, nature, connection, northern Norway",
    "long_bio": "Hailing from the breathtaking landscapes of northern Norway, The Blizzard is a thrilling electronica duo driven by a profound passion for merging the natural beauty of their surroundings with the sonic tapestry of their music. Transporting listeners to the ethereal landscapes of majestic, snowy mountains illuminated by the mesmerizing dance of the northern lights and a luminous moon, their music evokes vivid imagery and captivates the senses.<br><br>Their music weaves together soulful melodies, captivating textures, infectious basslines, and vibrant arpeggiators, creating a signature sound that sets them apart in the vast realm of electronic music. Rooted in the wonders of nature, The Blizzard consistently reminds us of our origins and the path that lies ahead.<br>With releases on prestigious labels like Armada, Anjunabeats, Enhanced, FSOE, Pure Trance, and more, the duo has enjoyed modest success in delivering their message to the world. Renowned trance maestro Armin van Buuren himself hailed their music as melodic pieces of art, solidifying their unique musical vision. Their work has garnered immense support from industry pioneers such as Tiësto, Ferry Corsten, Above & Beyond, Paul van Dyk, Solarstone, Andy Moor, Markus Schulz, and countless others.<br><br>In recent years, The Blizzard has ventured beyond the realm of trance, drawing inspiration from genres like synthwave, ambient, folk rock, and most recently, melodic house and techno. By exploring these musical avenues, they continue to expand their artistic horizons, infusing their signature style with new dimensions, while staying true to their profound connection with nature.<br><br>The Blizzard continues to captivate audiences around the world with their evocative and enchanting compositions, reminding us of the power of music to transport us to otherworldly realms. From the pristine landscapes of Norway to the hearts and souls of their listeners, The Blizzard's music serves as a vessel for transformation, taking us on a voyage where dreams, emotions, and melodies merge to create an extraordinary sonic experience.",
    "short_bio": "From the pristine landscapes of northern Norway, The Blizzard is a thrilling electronica duo driven by a deep passion for connecting listeners to nature through music. Their songs blend soulful melodies, captivating textures, infectious basslines, and vibrant arpeggiators, creating a distinctive sound that stands out in the electronic music realm. Rooted in the wonders of nature, The Blizzard consistently reminds us of our origins and the path ahead. With releases on prestigious labels like Armada, Anjunabeats, Enhanced, FSOE, Pure Trance, and more, the duo has enjoyed modest success in delivering a powerful message - art, nature, and people matter!",
    "additional_talents": "0",
    "talents_details": "",
    "logo": "https://api.typeform.com/responses/files/a8b530c141d6fbba230aad39eb13a355dac041e4fdecad50a78cd4bb13604e04/The_Blizzard_farger.pdf",
    "headshot": "https://api.typeform.com/responses/files/c6fbf7cde4b6982a18fb3f44b82b3cf75f36525d7bbaad69c647b027a935d1dc/theblizzard_24_Edit.jpg",
    "artist_rider": "",
    "facebook_link": "https://facebook.com/blizzardmusic",
    "instagram_link": "https://Instagram.com/theblizzardmusic",
    "twitter_link": "https://twitter.com/blizzardmusic",
    "youtube_link": "https://www.youtube.com/@TheBlizzardmusic",
    "spotify_link": "https://open.spotify.com/artist/40lHcSYwAqhkmBPoViitWP?si=WqLFRYVzQr-8RIDztBcvmg",
    "bandcamp_link": "https://theblizzard.bandcamp.com",
    "beatport_link": "https://www.beatport.com/artist/the-blizzard/54416",
    "soundcloud_link": "https://Soundcloud.com/blizzardmusic",
    "twitch_link": "https://Twitch.com/theblizzardmusic",
    "sound_better_link": "",
    "website_link": "https://linktr.ee/theblizzardmusic",
    "other_link": "https://docs.google.com/spreadsheets/d/1Ze3SvHV_hhEmhN6iRZrek3ZFe-Y0MT34QfHLP0Tg2Pw/edit#gid=0",
    "management_timeline": "https://docs.google.com/spreadsheets/d/1To0YfQPeSfACH1Gam1M4Ne35RmyYDcw36naPZGe2okI/edit#gid=1839572700",
    "start_date": "2023-11-28 14:12:33",
    "submit_date": "2023-11-28 14:47:57",
    "network_id": "f83d4ab95d",
    "tags": ""
  },
  {
    "id": 5,
    "email": "mark@bluebirdwoodenterprises.com",
    "artist_alias": "Bluebird Wood",
    "country": "USA",
    "age": "41",
    "act": "Producer/DJ",
    "other": "",
    "genre": "House",
    "unique_selling_points": "Distinct production, Visual-storytelling, social presence, confidence",
    "long_bio": "An Englishman in Vegas, Mark has been DJing since 1999 and professionally since 2004 after leaving University for studying Law. Having toured for 9 years producing and releasing trance on such esteemed labels as Anjunabeats, Armada, Garuda & collaborating with industry stalwarts such as Above & Beyond and Paul van Dyk; Mark decided to make a move to entertainment capital Las Vegas, after signing an exclusive residency with Hakkasan Nightclub when they opened in 2013. After a 7-year residency, Hakkasan Group was acquired by TAO Group - making for one of the most powerful nightlife and hospitality conglomerates in modern history. Furthermore, the MSG Sphere is due to open in 2023; somewhere Mark has his sights set for his newest concept...<br><br>In December of 2020, Mark embarked on the beginning of his most ambitious project yet + HOUSE of LEAVES - a sprawling live immersive event experience fusing a twisted narrative in the nightclub environment. In partnership with new venture Bluebird Wood Enterprises, Mark has stepped into event production, art & theatre as well as general music-related projects & concept creation, where YOU get to be a part of the Story as the music guides listeners through some of the most unique venues in the World.",
    "short_bio": "Originally from the U.K., Mark Eteson has been DJing since 1999 and professionally since 2004. He toured for nine years producing trance and releasing music on esteemed labels such as Anjunabeats, Armada and Garuda, collaborating with industry stalwarts such as Above & Beyond and Paul van Dyk. <br>In 2013, Eteson decided to make a move to the entertainment capital of the world, Las Vegas, after signing an exclusive residency with Hakkasan Nightclub. As the music industry in Las Vegas soared to new heights, so did Eteson, constantly evolving to the changing preferences of the audience and their thirst for new content.<br>As a new decade began, he embarked on his most ambitious project yet, HOUSE of LEAVES in December 2020 — an immersive live-music experience that spins a fresh nightlife narrative. In partnership with Bluebird Wood Enterprises, Eteson stepped into the world of music-event production, taking an innovative approach, fusing art and theater from concept to creation: YOU are part of the story as the music guides you through some of the most unique venues in the world.<br>In 2024, expect to see Eteson writing an album and touring under the moniker “Bluebird Wood.” He aims to bring his concept production, “The Story of Everything,” to multiple destinations, or Las Vegas, for a world premiere with the goal of touching 1 million people. Featuring insane visuals, the DJ-driven show chronicles the history of the universe in three hours.",
    "additional_talents": "1",
    "talents_details": "Video, graphic design, voiceover, radio/podcast, TV, presenting",
    "logo": "https://api.typeform.com/responses/files/691d3f1c7251ac65a7e1c05692ff32ff86708c7a53f26ac8643fb19c2057b369/BW_FULL_LOGO_BLACK_3x.png",
    "headshot": "https://api.typeform.com/responses/files/1d49b1407e1fa218e4532d882fff6eb75c9bffd451efd54a649ed97180192f16/MarkEteson.SammyDean.03.17.21_64.jpg",
    "artist_rider": "",
    "facebook_link": "",
    "instagram_link": "https://instagram.com/@marketeson",
    "twitter_link": "https://twitter.com/marketeson",
    "youtube_link": "https://youtube.com/marketeson",
    "spotify_link": "https://open.spotify.com/artist/6vwohTnFjRH2dQCZd32eSB?si=NvsHQeZOTCK8MfARHUlUUg",
    "bandcamp_link": "https://bluebirdwood.bandcamp.com/",
    "beatport_link": "https://www.beatport.com/artist/mark-eteson/20572",
    "soundcloud_link": "https://soundcloud.com/marketeson",
    "twitch_link": "",
    "sound_better_link": "",
    "website_link": "https://bluebirdwood.com",
    "other_link": "https://docs.google.com/spreadsheets/d/1l5jNt4hOOLvtwbOCFY6qCshO9BthJoKREcQwouDc9ao/edit#gid=0",
    "management_timeline": "",
    "start_date": "2023-12-08 21:22:09",
    "submit_date": "2023-12-08 21:47:28",
    "network_id": "cf859f76c6",
    "tags": ""
  }
]